scripts/load-test/artillery-configs/auth-only.yml
config:
  target: http://localhost:5000
  phases:
  - duration: 60
    arrivalRate: 5
    name: Warmup
  - duration: 120
    arrivalRate: 20
    name: Ramp-up
  - duration: 300
    arrivalRate: 50
    name: Sustained Load
  variables:
    timestamp: {{ $timestamp }}
    randomId: {{ $randomNumber(1, 10000) }}
  processor: ./artillery-processor.js
  plugins:
    expect:
    metrics:
      namespace: load-test-auth-only
scenarios:
- name: Authentication Only
  flow: 
    0:
      post:
        url: /api/v1/auth/register
        headers:
        json:
          dynamic: true
        capture:
        - json: $.data.user._id
          as: userId
        - json: $.data.accessToken
          as: accessToken
        - json: $.data.refreshToken
          as: refreshToken
        - json: $.data.user.email
          as: email
        expect:
        - statusCode: 201
    1:
      think: 2934
    2:
      post:
        url: /api/v1/auth/login
        headers:
        json:
          dynamic: true
        capture:
        - json: $.data.accessToken
          as: accessToken
        - json: $.data.refreshToken
          as: refreshToken
        expect:
        - statusCode: 200
    3:
      think: 1707
    4:
      post:
        url: /api/v1/auth/refresh-token
        headers:
        json:
          dynamic: true
        capture:
        - json: $.data.accessToken
          as: accessToken
        expect:
        - statusCode: 200
    5:
      think: 2773
    6:
      get:
        url: /api/v1/user/profile
        headers:
          Authorization: Bearer {{ accessToken }}
          Content-Type: application/json
        expect:
        - statusCode: 200