scripts/load-test/artillery-configs/user-journey.yml
config:
  target: http://localhost:5000
  phases:
  - duration: 60
    arrivalRate: 2
    name: Warmup
  - duration: 120
    arrivalRate: 5
    name: Ramp-up
  - duration: 300
    arrivalRate: 10
    name: Sustained Load
  - duration: 60
    arrivalRate: 20
    name: Spike
  variables:
    timestamp: {{ $timestamp }}
    randomId: {{ $randomNumber(1, 10000) }}
  processor: ./artillery-processor.js
  plugins:
    expect:
    metrics:
      namespace: load-test-user-journey
scenarios:
- name: Complete User Journey
  flow: 
    0:
      post:
        url: /api/v1/auth/register
        headers:
        json:
          dynamic: true
        capture:
        - json: $.data.user._id
          as: userId
        - json: $.data.accessToken
          as: accessToken
        - json: $.data.user.email
          as: email
        - json: $.data.user.name
          as: name
        expect:
        - statusCode: 201
    1:
      think: 1066
    2:
      post:
        url: /api/v1/auth/login
        headers:
        json:
          dynamic: true
        capture:
        - json: $.data.accessToken
          as: accessToken
        - json: $.data.refreshToken
          as: refreshToken
        expect:
        - statusCode: 200
    3:
      think: 2570
    4:
      get:
        url: /api/v1/user/profile
        headers:
          Authorization: Bearer {{ accessToken }}
          Content-Type: application/json
        expect:
        - statusCode: 200
    5:
      think: 1390
    6:
      post:
        url: /api/v1/tasks
        headers:
          Authorization: Bearer {{ accessToken }}
          Content-Type: application/json
        json:
          dynamic: true
        capture:
        - json: $.data._id
          as: taskId
        - json: $.data.title
          as: taskTitle
        expect:
        - statusCode: 201
    7:
      think: 2142
    8:
      get:
        url: /api/v1/tasks?page=1&limit=20&sort=-createdAt
        headers:
          Authorization: Bearer {{ accessToken }}
          Content-Type: application/json
        expect:
        - statusCode: 200
    9:
      think: 1970
    10:
      get:
        url: /api/v1/tasks/{{ {{ taskId  }}}}
        headers:
          Authorization: Bearer {{ accessToken }}
          Content-Type: application/json
        expect:
        - statusCode: 200
    11:
      think: 1540
    12:
      patch:
        url: /api/v1/tasks/{{ {{ taskId  }}}}
        headers:
          Authorization: Bearer {{ accessToken }}
          Content-Type: application/json
        json:
          status: in-progress
        expect:
        - statusCode: 200
    13:
      think: 2346
    14:
      get:
        url: /api/v1/tasks?search={{ encodeURIComponent({{ name  }}})}&limit=10
        headers:
          Authorization: Bearer {{ accessToken }}
          Content-Type: application/json
        expect:
        - statusCode: 200